is backache normal during the third trimester of pregnancy#The extra weight you've gained is putting added pressure on your back, making it feel achy and sore. You might also feel discomfort in your pelvis and hips as your ligaments loosen to prepare for labor
what is labor induction#Induction can be the right choice for some women, but it has risks.And it doesn’t always work. If it doesn’t, you may need another induction or a c-section
what's the deal with eating fish during pregnancy#many fish are also packed with healthy omega-3 fatty acids, which may be important in promoting your baby's brain health
Can I drink caffeine while pregnant#higher risk of miscarriage
Do I really get to eat for two during pregnancy#The phrase eating for two implies that you get to take in double the calories you normally ingest. It's true that a normal-weight person should gain 25 to 35 pounds during a healthy pregnancy, but you don't need many extra calories to accomplish this
Is it safe to fly while pregnant#is generally safe for many mothers
what is prenatal care#Prenatal care is the health care you get while you are pregnant
why do I need prenatal care#Prenatal care can help keep you and your baby healthy. Babies of mothers who do not get prenatal care are three times more likely to have a low birth weight and five times more likely to die than those born to mothers who do get care
how often should i see my doctor during pregnancy#Your doctor will give you a schedule of all the doctor's visits you should have while pregnant. Most experts suggest you see your doctor
About once each month for weeks 4 through 28#If you are older than 35 or your pregnancy is high risk, you'll probably see your doctor more often
What are the effects of drugs on an unborn child#Studies show that using drugs -- legal or illegal -- during pregnancy has a direct impact on the fetus. If you smoke, drink alcohol, or ingest caffeine, so does the fetus. If you use marijuana or crystal meth, your fetus also feels the impact of these dangerous drugs -- and if you are addicted to cocaine, you're not only putting your own life on the line, but you are risking the health of your unborn baby.
can you use castor oil while pregnant to bring on labor#Some people recommend a dose of castor oil to kick-start labor, but it tastes terrible and violent diarrhea might spoil the mood. It is not recommended.
is frequent urination normal during the second trimester of pregnancy#Your uterus will rise away from the pelvic cavity during the second trimester, giving you a brief break from having to keep going to the bathroom. Don't get too comfortable, though. The urge to go will come back during the last trimester of your pregnancy.
can food poisoning while pregnant hurt the baby#Normal changes in your body during pregnancy may make you more likely to get food poisoning. During pregnancy, food poisoning can cause serious problems for you and your baby, including premature birth, miscarriage and stillbirth. 
can i drink milk#Milk is a good source of calcium and protein and should be part of the pregnant women's dite. It helps in building strong bones in the growing baby.
can i drink more water#It is recommended that you drink 8-12 glasses of water a day. Morning sickness, acid reflux and tiny bladders usually prevent you from chugging too much water throughout the day.
How many hours can i sleep#It is recommended that mothers to be spend at least 8 hours in bed each night.
Can i eat papaya during pregnancy#since ages papaya has been used as a food to abort an unwanted pregnancy. Consuming papaya during pregnancy is a strict NO!
Best fruits to eat during pregnancy#Apricots, Oranges, Mangoes, Pears, Pomegranates, Avacodos, Guava, Bananas are the best to eat during pregnancy.
What diet should i follow during pregnancy#Pregnant women should include good protein sources the baby's growth, Protein-rich foods include meat, poultry, fish, eggs, beans, milk, nuts etc.
What precautions should i take in fifth month of pregnancy#Avoid undercooked or raw Fish and Meat. Avoid soft cheeses and deli meats. Avoid walking and standing for long hours at a stretch. Avoid lifting heavy weights
What precautions should i take in ninth month of pregnancy#Do take a multivitamin. Eating a balanced diet that's rich in vitamins and minerals is the best way to provide your body with all of the healthy nutrients it needs to support a growing baby. Do get lots of sleep. Do work out. Do eat seafood.
How can i eat vegetables during pregnancy#Cut and pair your favorite raw veggies with a dip like hummus ranch, or greek yogurt, fruit salad.
What vegetables should be avoided during pregnancy#Raw and undercooked greens and sprouts like mung beans, alfalfa, clover, radish.
Can negative thoughts affect pregnancy#Pregnant women's stress, anxiety, depression and other negative emotions can affect the growth and the development of the fetus.
How can i get rid of my negative thoughts during pregnancy#Focus on your body. It's good for you and your baby if you can relax, so don't feel guilty about taking some time to yourself. Get enough rest and sleep. Try gentle exercise.
How does mother's emotions affect the baby in the womb#The stress in the womb can affect a baby's temperature and neurobehavioral development.
Why is medical care important during pregnancy#Getting early and regular prenatal care improves the chances of the healthy pregnancy.
Hi # Hello
How are you # I am fine.How may I Help You